Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `p50, p75, p95, p99, p999`: Percentiles of the durations. For example, the value in `p95` means that 95 % of the measurements were faster than this duration.
ja_jp: `p50, p75, p95, p99, p999`: 接続時間のパーセンタイルです。例えば、 `p95` の値は、測定値の95%がこの接続時間よりも速かったことを意味します。

source: `package` - defaults to `groupId`
ja_jp: `package` - デフォルトは `groupId`

source: `page` - a page number which should be returned by a list operation. It applies to the paged resources only and is a number starting with 0. Default is 0.
ja_jp: `page` - リスト操作で返されるべきページ番号。これはページ化されたリソースにのみ適用され、0 から始まる番号です。 デフォルトは 0 です。

source: `paged` - whether collection responses should be paged or not. First, last, previous and next page URIs are included in the response headers if they exist. Request page index and size are taken from the `page` and `size` query parameters that default to `0` and `20` respectively. Default is `true`.
ja_jp: `paged` - コレクションのレスポンスをページングするかどうか。最初、最後、前、次のページの URI が存在する場合は、レスポンスヘッダに含まれます。リクエストページのインデックスとサイズは、 `page` と `size` のクエリパラメーターから取得され、それぞれのデフォルトは `0` と `20` です。デフォルトは `true` です。

source: `paragraph` that resolves to `<p>My text!</p>` will be rendered as `<p>My text!</p>`
ja_jp: `<p>My text!</p>` に解決する `paragraph` は、`<p>My text!</p>` としてレンダリングされます。

source: `param:val = 'information'` is used to pass a named parameter to the fragment.
ja_jp: `param:val = 'information'` は、名前付きパラメータをフラグメントに渡すために使われます。

source: `path` - operation path (this is appended to the resource base path). Default is an empty string.
ja_jp: `path` - 操作パス (これはリソースベースのパスに追加されます)。デフォルトは空の文字列です。

source: `path` - resource base path. Default path is a hyphenated lowercase resource name without a suffix of `resource` or `controller`.
ja_jp: `path` - リソースのベースパス。デフォルトのパスは、 `resource` または `controller` のサフィックスを含まないハイフン付きの小文字のリソース名です。

source: `perf` works in older Linux systems, whereas eBPF requires a newer Linux kernel. The overhead of `perf` is higher than eBPF, but it can understand stack traces generated with DWARF debug symbols, which eBPF can't.
ja_jp: eBPFは新しいLinuxカーネルを必要とするのに対し、 `perf` は古いLinuxシステムで動作します。 `perf` のオーバーヘッドは eBPF よりも大きいですが、eBPF では扱えない DWARF デバッグシンボルで生成されたスタックトレースを扱えます。

source: `performedChecks`: A counter that increases by one each time the user asks about a number.
ja_jp: `performedChecks` : ユーザーが数字を質問するたびに1ずつ増えるカウンター。

source: `performedChecks`: A counter which is increased by one each time the user asks about a number.
ja_jp: `performedChecks` : ユーザーが数字を尋ねるたびに1つ増えるカウンター。

source: `pkg/**/Ci*leTest`: all classes in the package `pkg` and subpackages, starting with `Ci` and ending with `leTest`
ja_jp: `pkg/**/Ci*leTest`: パッケージ `pkg` とサブパッケージ内の、`Ci` で始まり `leTest` で終わるすべてのクラス。

source: `plus` or `+`: Addition
ja_jp: `plus` または `+`: 加算

source: `podman-docker` installed to emulate the Docker CLI for Quarkus Dev Services.
ja_jp: Quarkus Dev ServicesのDocker CLIをエミュレートするために `podman-docker` がインストールされていること

source: `policies` alias is created for the classpath `/policies.jar` resource.
ja_jp: クラスパス `/policies.jar` リソースに対して `policies` エイリアスが作成されます。

source: `prefix` is optional. If not set then the prefix to be used will be determined by the class name. In this case it would still be `greeting` (since the `Configuration` suffix is removed). If the class were named `GreetingExtraConfiguration` then the resulting default prefix would be `greeting-extra`.
ja_jp: `prefix` は任意です。設定していない場合は、使用される接頭辞はクラス名によって決まります。この場合も (`Configuration` の接尾辞は削除されているため) `greeting` となります。クラス名が `GreetingExtraConfiguration` の場合は、デフォルトの接頭辞が `greeting-extra` となります。

source: `primary` is a dimensional tag with value `blue`.
ja_jp: `primary` は、値が `blue` のディメンションタグです。

source: `private_key_jwt` with the PEM key file, signature algorithm is RS256:
ja_jp: PEM キーファイルを使用した `private_key_jwt` 、署名アルゴリズムは RS256 です。

source: `private_key_jwt` with the PEM key file, signature algorithm is `RS256`:
ja_jp: PEM キーファイルを使用した `private_key_jwt` 、署名アルゴリズムは `RS256` です。

source: `private_key_jwt` with the PEM key inlined in application.properties, and where the signature algorithm is `RS256`:
ja_jp: PEM キーが application.properties にインライン化され、署名アルゴリズムが `RS256` である `private_key_jwt:

source: `private_key_jwt` with the PEM key inlined in application.properties, where the signature algorithm is `RS256`:
ja_jp: 署名アルゴリズムが `RS256` で、PEM キーが application.properties にインライン化された `private_key_jwt` は以下のとおりです。

source: `private_key_jwt` with the key store file, signature algorithm is RS256:
ja_jp: キーストアファイルを使用した `private_key_jwt` 、署名アルゴリズムは RS256 です。

source: `private_key_jwt` with the key store file, signature algorithm is `RS256`:
ja_jp: キーストアファイルを使用した`private_key_jwt`、署名アルゴリズムは `RS256` です。

source: `private_key_jwt` with the keystore file, signature algorithm is `RS256`:
ja_jp: キーストアファイルを使用した `private_key_jwt` 、署名アルゴリズムは `RS256` です。

source: `private_key_jwt`, where a private RSA or EC key is used to sign a JWT token
ja_jp: `private_key_jwt` では、秘密の RSA または EC キーを使用して JWT トークンに署名します。

source: `project` groups metadata that is relevant for project creation tools
ja_jp: `project` はプロジェクト作成ツールに関連するメタデータをグループ化します。

source: `proto` files from dependencies
ja_jp: 依存関係にある `proto` ファイル

source: `proto` files with imports
ja_jp: `proto` ファイルのインポート

source: `protoc` also supports https://protobuf.dev/reference/kotlin/kotlin-generated/[generating Kotlin code] in addition to the generated Java code.
ja_jp: `protoc` は、生成されたJavaコードに加えて link:https://protobuf.dev/reference/kotlin/kotlin-generated/[Kotlinコードの生成] もサポートしています。

source: `protocol` is a dimensional tag with value `http`.
ja_jp: `protocol` は、値が `http` のディメンションタグです。

source: `providesIf` allows listing multiple `<positive>` as well as `<negative>` elements.
ja_jp: `providesIf` は、複数の `<positive>` と `<negative>` の要素をリストアップできます。

source: `publish` a message to a specific address - all consumers receive the messages.
ja_jp: 特定のアドレスにメッセージを `publish` (発行) - すべてのコンシューマーがメッセージを受信する。

source: `px(milliseconds)` - Set the specified expire time, in milliseconds.
ja_jp: `px(milliseconds)`: 指定した有効期限をミリ秒単位で設定します。

source: `pxat(timestamp-milliseconds)` - Set the specified Unix time at which the key will expire, in milliseconds.
ja_jp: `pxat(timestamp-milliseconds)`: キーの有効期限が切れる Unix 時間をミリ秒単位で設定します。

source: `quarkus deploy` in all dev tools
ja_jp: すべての開発ツールで `quarkus deploy`

source: `quarkus-elytron-security-oauth2` is the best choice if you need a light weight library for the remote introspection of either opaque or JWT tokens.
ja_jp: `quarkus-elytron-security-oauth2` は、不透明なトークンやJWTトークンをリモートでイントロスペクションするための軽量なライブラリが必要な場合に最適な選択肢です。

source: `quarkus-elytron-security-oauth2` provides an alternative to `quarkus-oidc` Bearer Token Authentication Mechanism. It is based on `Elytron` and is primarily meant for introspecting the opaque tokens remotely.
ja_jp: `quarkus-elytron-security-oauth2` は `quarkus-oidc` Bearer Token 認証メカニズムの代替手段を提供します。これは `Elytron` をベースにしており、主に不透明なトークンをリモートでイントロスペクトするためのものです。

source: `quarkus-elytron-security-oauth2` provides an alternative to the Quarkus `quarkus-oidc` Bearer token authentication mechanism extension. `quarkus-elytron-security-oauth2` is based on `Elytron` and is primarily intended for introspecting opaque tokens remotely.
ja_jp: `quarkus-elytron-security-oauth2` は、Quarkus `quarkus-oidc` ベアラートークン認証メカニズムエクステンションに対する別の選択肢を提供するものです。 `quarkus-elytron-security-oauth2` は `Elytron` に基づいており、主に不透明トークンをリモートでイントロスペクトすることを目的としています。

source: `quarkus-elytron-security-oauth2` provides an alternative to the `quarkus-oidc` Bearer Token authentication mechanism. `quarkus-elytron-security-oauth2` is based on `Elytron` and is primarily intended for introspecting opaque tokens remotely. For more information, see xref:security-oauth2.adoc[Using OAuth2].
ja_jp: `quarkus-elytron-security-oauth2` は `quarkus-oidc` ベアラートークン認証メカニズムに対する別の選択肢を提供するものです。 `quarkus-elytron-security-oauth2` は `Elytron` をベースにしており、主に不透明なトークンをリモートでイントロスペクトするためのものです。 詳細は xref:security-oauth2.adoc[OAuth2 の使用] を参照ください。

source: `quarkus-hibernate-orm`: Uses the xref:hibernate-orm.adoc[`quarkus-hibernate-orm`] extension to persist processing states. It is similar to the previous state store, but it uses Hibernate ORM instead of Hibernate Reactive.
ja_jp: `quarkus-hibernate-orm` : link:hibernate-orm.html[`quarkus-hibernate-orm`] エクステンションを使用して、処理ステートを永続化します。先ほどのステートストアと似ていますが、Hibernate Reactiveの代わりにHibernate ORMを使用します。

source: `quarkus-hibernate-reactive`: Uses the xref:hibernate-reactive.adoc[`quarkus-hibernate-reactive`] extension to persist processing states. Processing state objects are required to be a Jakarta Persistence entity and extend the `CheckpointEntity` class, which handles object identifiers composed of the consumer group id, topic and partition. Therefore, the class name of the entity needs to be configured using the `checkpoint.state-type` property.
ja_jp: `quarkus-hibernate-reactive`: xref:hibernate-reactive.adoc[`quarkus-hibernate-reactive`]エクステンションを使用して処理ステートを永続化します。 処理ステートオブジェクトは、Jakarta Persistence エンティティーであり、 `CheckpointEntity`クラスを拡張する必要があります。 このクラスは、コンシューマーグループ ID、トピック、パーティションが含まれるオブジェクト識別子を処理します。 したがって、エンティティーのクラス名は、 `checkpoint.state-type` プロパティーを使用して設定する必要があります。

source: `quarkus-jacoco` can generate your test coverage reports.
ja_jp: `quarkus-jacoco` では、テストカバレッジレポートを作成することができます。

source: `quarkus-jdbc-db2` for link:https://www.ibm.com/products/db2-database[IBM DB2]
ja_jp: link:https://www.ibm.com/products/db2-database[IBM DB2] のための `quarkus-jdbc-db2`

source: `quarkus-jdbc-derby` for link:https://db.apache.org/derby/[Apache Derby]
ja_jp: link:https://db.apache.org/derby/[アパッチダービー] のための `quarkus-jdbc-derby`

source: `quarkus-jdbc-h2` for link:https://www.h2database.com/html/main.html[H2]
ja_jp: link:https://www.h2database.com/html/main.html[H2] のための `quarkus-jdbc-h2`

source: `quarkus-jdbc-mariadb` for link:https://mariadb.com/[MariaDB]
ja_jp: link:https://mariadb.com/[MariaDB] のための `quarkus-jdbc-mariadb`

source: `quarkus-jdbc-mssql` for link:https://www.microsoft.com/en-gb/sql-server/[Microsoft SQL Server]
ja_jp: link:https://www.microsoft.com/en-gb/sql-server/[Microsoft SQL Server] のための `quarkus-jdbc-mssql`

source: `quarkus-jdbc-mysql` for link:https://www.mysql.com/[MySQL]
ja_jp: link:https://www.mysql.com/[MySQL] のための `quarkus-jdbc-mysql`

source: `quarkus-jdbc-oracle` for link:https://www.oracle.com/database/[Oracle Database]
ja_jp: link:https://www.oracle.com/database/[Oracle Database] のための `quarkus-jdbc-oracle`

source: `quarkus-jdbc-postgresql` for link:https://www.postgresql.org/[PostgreSQL]
ja_jp: link:https://www.postgresql.org/[PostgreSQL] のための `quarkus-jdbc-postgresql`

source: `quarkus-junit5` is required for testing, as it provides the `@QuarkusTest` annotation that controls the testing framework. `rest-assured` is not required but is a convenient way to test HTTP endpoints, we also provide integration that automatically sets the correct URL so no configuration is required.
ja_jp: `quarkus-junit5` は、テストフレームワークを制御する `@QuarkusTest` アノテーションを提供するため、テストには必須です。 `rest-assured` は必須ではありませんが、HTTP エンドポイントをテストするのに便利な方法です。

source: `quarkus-junit` is required for testing, as it provides the `@QuarkusTest` annotation that controls the testing framework. `rest-assured` is not required but is a convenient way to test HTTP endpoints, we also provide integration that automatically sets the correct URL so no configuration is required.
ja_jp: `quarkus-junit` は、テストフレームワークを制御する `@QuarkusTest` アノテーションを提供するため、テストに必要です。 `rest-assured` は必須ではありませんが、HTTP エンドポイントをテストするのに便利な方法です。また、正しい URL を自動的に設定するインテグレーションも提供しているため、設定は不要です。

source: `quarkus-maven-plugin` retrieves a version of `protoc` (the protobuf compiler) from Maven repositories. The retrieved version matches your operating system and CPU architecture. If this retrieved version does not work in your context, you can either force to use a different OS classifier with `-Dquarkus.grpc.protoc-os-classifier=your-os-classifier` (e.g. `osx-x86_64`). You can also download the suitable binary and specify the location via `-Dquarkus.grpc.protoc-path=/path/to/protoc`.
ja_jp: `quarkus-maven-plugin` は、Mavenリポジトリから `protoc` (protobuf コンパイラ)のバージョンを取得します。取得されたバージョンは、使用しているオペレーティングシステムとCPUアーキテクチャに適合します。この検索されたバージョンがあなたのコンテキストで動作しない場合は、 `-Dquarkus.grpc.protoc-os-classifier=your-os-classifier` で別の OS クラシファイアを強制的に使用することができます (例: `osx-x86_64` )。また，適切なバイナリをダウンロードし、 `-Dquarkus.grpc.protoc-path=/path/to/protoc` でその場所を指定することもできます。

source: `quarkus-my-ext-deployment` in the `extensions/my-ext/deployment` directory; a basic `MyExtProcessor` class is generated in this module.
ja_jp: `extensions/my-ext/deployment` ディレクトリーの `quarkus-my-ext-deployment`: 基本的な `MyExtProcessor` クラスはこのモジュールで生成されます。

source: `quarkus-my-ext-deployment` is added to the `<dependencyManagement>` of the Quarkus BOM (Bill of Materials) `bom/application/pom.xml`
ja_jp: `quarkus-my-ext-deployment` が Quarkus BOM (Bill of Materials) の `<dependencyManagement>` に追加されました。

source: `quarkus-my-ext-integration-test` in the `integration-tests/my-ext/deployment` directory; an empty JAX-RS Resource class and two test classes (for JVM mode and native mode) are generated in this module.
ja_jp: `integration-tests/my-ext/deployment` ディレクトリに `quarkus-my-ext-integration-test` ; 空の JAX-RS Resource クラスと 2 つのテストクラス (JVM モードとネイティブモード用) がこのモジュールで生成されます。

source: `quarkus-my-ext-integration-test` in the `integration-tests/my-ext/deployment` directory; an empty Jakarta REST Resource class and two test classes (for JVM mode and native mode) are generated in this module.
ja_jp: `integration-tests/my-ext/deployment` ディレクトリーの `quarkus-my-ext-integration-test`: 空の Jakarta REST Resource クラスと 2 つのテストクラス (JVM モードとネイティブモード用) がこのモジュールで生成されます。

source: `quarkus-my-ext-integration-test` is added to the `<modules>` of `quarkus-integration-tests-parent`
ja_jp: quarkus-my-ext-integration-test` は `quarkus-integration-tests-parent` の `<modules>` に追加されました。

source: `quarkus-my-ext-parent` in the `extensions/my-ext` directory
ja_jp: `extensions/my-ext` ディレクトリーの `quarkus-my-ext-parent`

source: `quarkus-my-ext-parent` is added to the `<modules>` of `quarkus-extensions-parent`
ja_jp: `quarkus-my-ext-parent` が `quarkus-extensions-parent` の `<modules>` に追加されました。

source: `quarkus-my-ext` in the `extensions/my-ext/runtime` directory
ja_jp: `extensions/my-ext/runtime` ディレクトリーの `quarkus-my-ext`

source: `quarkus-my-ext` is added to the `<dependencyManagement>` of the Quarkus BOM (Bill of Materials) `bom/application/pom.xml`
ja_jp: `quarkus-my-ext` が Quarkus BOM (Bill of Materials) の `<dependencyManagement>` に追加されました。

source: `quarkus-narayana-lra` needs to be complemented with a server JAX-RS implementation and a REST Client implementation in order to work. This means that users should also have either `quarkus-resteasy-jackson` and `quarkus-rest-client-jackson` or `quarkus-resteasy-reactive-jackson` and `quarkus-rest-client-reactive-jackson` dependencies in their application.
ja_jp: `quarkus-narayana-lra` が動作するためには、サーバーの JAX-RS 実装と REST クライアントの実装で補完する必要があります。つまり、ユーザーのアプリケーションには、 `quarkus-resteasy-jackson` と `quarkus-rest-client` または `quarkus-resteasy-reactive-jackson` と `quarkus-rest-client-reactive` のいずれかの依存関係が必要です。

source: `quarkus-narayana-lra` needs to be complemented with a server Jakarta REST implementation and a REST Client implementation in order to work. This means that users should also have either `quarkus-resteasy-jackson` and `quarkus-rest-client-jackson` or `quarkus-resteasy-reactive-jackson` and `quarkus-rest-client-reactive-jackson` dependencies in their application.
ja_jp: `quarkus-narayana-lra` を動作させるためには、サーバーの Jakarta REST 実装と REST Client 実装で補完する必要があります。つまり、ユーザーはアプリケーションに `quarkus-resteasy-jackson` と `quarkus-rest-client-Jackson`、または `quarkus-resteasy-reactive-jackson` と`quarkus-rest-client-reactive-jackson` のいずれかの依存関係を持つ必要があります。

source: `quarkus-narayana-lra` needs to be complemented with a server Jakarta REST implementation and a REST Client implementation in order to work. This means that users should also have either `quarkus-resteasy-jackson` and `quarkus-rest-client-jackson` or `quarkus-resteasy-reactive-jackson` and `quarkus-resteasy-client-reactive-jackson` dependencies in their application.
ja_jp: `quarkus-narayana-lra` を動作させるには、サーバーの Jakarta REST 実装と REST Client 実装で補完する必要があります。 つまり、 `quarkus-resteasy-jackson` と `quarkus-rest-client-jackson` 、または `quarkus-resteasy-reactive-Jackson` と `quarkus-resteasy-client-reactive-jackson` の依存関係が必要です。

source: `quarkus-narayana-lra` needs to be complemented with a server Jakarta REST implementation and a REST Client implementation in order to work. This means that users should also have either `quarkus-resteasy-jackson` and `quarkus-resteasy-client-jackson` or `quarkus-rest-jackson` and `quarkus-rest-client-jackson` dependencies in their application.
ja_jp: `quarkus-narayana-lra` を動作させるには、サーバーの Jakarta REST 実装と REST Client 実装と共に使用する必要があります。 つまり、 `quarkus-resteasy-jackson` と `quarkus-resteasy-client-jackson` 、または `quarkus-rest-jackson` と `quarkus-rest-client-jackson` の依存関係も必要です。

source: `quarkus-oidc-client-filter` extension depends on the `quarkus-oidc-client` extension and provides JAX-RS `OidcClientRequestFilter` which sets the access token acquired by `OidcClient` as an HTTP `Authorization` header's `Bearer` scheme value. This filter can be registered with MP RestClient implementations injected into the current Quarkus endpoint but it is not related to the authentication requirements of this service endpoint. For example, it can be a public endpoint or it can be protected with MTLS - the important point is that this Quarkus endpoint does not have to be protected itself with the Quarkus OpenID Connect adapter.
ja_jp: `quarkus-oidc-client-filter` `quarkus-oidc-client` `OidcClient` エクステンションに依存しており、 `OidcClient` によって取得されたアクセス トークンを HTTP `Authorization` ヘッダーの `Bearer` スキームとして設定する JAX-RS `OidcClientRequestFilter` を提供します。このフィルターは、現在の Quarkus エンドポイントに挿入された MP RestClient 実装で登録できますが、このサービス エンドポイントの認証要件とは関係ありません。たとえば、パブリック エンドポイントにすることも、MTLS で保護することもできます。重要な点は、この Quarkus エンドポイント自体を Quarkus OpenID Connect アダプターで保護する必要がないということです。

source: `quarkus-oidc-client-filter` extension provides `io.quarkus.oidc.client.filter.OidcClientRequestFilter` JAX-RS ClientRequestFilter which uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization` `Bearer` scheme value.
ja_jp: `quarkus-oidc-client-filter` エクステンションは `io.quarkus.oidc.client.filter.OidcClientRequestFilter` JAX-RS ClientRequestFilter を提供します。このフィルターは、 `OidcClient` を使用してアクセストークンを取得し、必要に応じて更新し、HTTP `Authorization` `Bearer` スキーム値として設定します。

source: `quarkus-oidc-client-filter` extension provides `io.quarkus.oidc.client.filter.OidcClientRequestFilter` Jakarta REST ClientRequestFilter which uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization` `Bearer` scheme value.
ja_jp: `quarkus-oidc-client-filter` エクステンションは、 `io.quarkus.oidc.client.filter.OidcClientRequestFilter` Jakarta REST ClientRequestFilter を提供し、 `OidcClient` を使用してアクセストークンを取得し、必要に応じてリフレッシュし、HTTP `Authorization` `Bearer` スキーム値として設定します。

source: `quarkus-oidc-client-reactive-filter` extension provides `io.quarkus.oidc.client.filter.OidcClientRequestReactiveFilter`.
ja_jp: `quarkus-oidc-client-reactive-filter` エクステンションは、 `io.quarkus.oidc.client.filter.OidcClientRequestReactiveFilter` を提供します。

source: `quarkus-oidc-client` can be configured as follows to support `MTLS`:
ja_jp: `quarkus-oidc-client` は、以下のように設定することで、 `MTLS` をサポートすることができます：

source: `quarkus-oidc-client` extension provides `OidcClient` for acquiring and refreshing access tokens from OpenID Connect and OAuth2 providers which support `client-credentials`, `password` and `refresh_token` token grants.
ja_jp: `quarkus-oidc-client` エクステンションは、 `client-credentials`、 `password` および `refresh_token` トークングラントをサポートする OpenID Connect および OAuth2 プロバイダーからアクセストークンを取得したり、更新したりするための `OidcClient` を提供します。

source: `quarkus-oidc-client` extension provides a reactive `io.quarkus.oidc.client.OidcClient` which can be used to acquire and refresh tokens using SmallRye Mutiny `Uni` and `Vert.x WebClient`.
ja_jp: `quarkus-oidc-client` エクステンションは、SmallRye Mutiny `Uni` および `Vert.xWebClient` を使用してトークンを取得および更新するために使用できるリアクティブな `io.quarkus.oidc.client.OidcClient` を提供します。

source: `quarkus-oidc-client` supports a non-standard `client_secret_post_jwt` authentication method which can be configured as follows:
ja_jp: `quarkus-oidc-client` は、以下のように設定できる標準外の `client_secret_post_jwt` 認証方法をサポートしています。

source: `quarkus-oidc-client` supports a non-standard `client_secret_post_jwt` authentication method, which can be configured as follows:
ja_jp: `quarkus-oidc-client` は、以下のように設定できる標準外の `client_secret_post_jwt` 認証方法をサポートしています。

source: `quarkus-oidc-client`, `quarkus-oidc-client-reactive-filter` and `quarkus-oidc-client-filter` extensions to acquire and refresh access tokens from OpenID Connect and OAuth 2.0 compliant Authorization Servers such as https://www.keycloak.org[Keycloak]
ja_jp: `quarkus-oidc-client`、 `quarkus-oidc-client-reactive-filter`、および `quarkus-oidc-client-filter` エクステンションを使用して、OpenId Connect および https://www.keycloak.org[Keycloak] などの OAuth 2.0 準拠の認可サーバーからアクセストークンを取得し、更新する方法

source: `quarkus-oidc-client`, `quarkus-oidc-client-reactive-filter` and `quarkus-oidc-client-filter` extensions to acquire and refresh access tokens from OpenID Connect and OAuth 2.0 compliant Authorization Servers such as link:https://www.keycloak.org[Keycloak]
ja_jp: OpenID Connectや link:https://www.keycloak.org[Keycloak] などのOAuth 2.0準拠の認可サーバーからアクセストークンを取得し、リフレッシュするための、 `quarkus-oidc-client` や、 `quarkus-oidc-client-reactive-filter` 、 `quarkus-oidc-client-filter` エクステンション

source: `quarkus-oidc-token-propagation-reactive` and `quarkus-oidc-token-propagation` extensions to propagate the current `Bearer` or `Authorization Code Flow` access tokens
ja_jp: 現在の `Bearer` または `Authorization Code Flow` アクセストークンを伝播する `quarkus-oidc-token-propagation-reactive` エクステンションと `quarkus-oidc-token-propagation` エクステンション

source: `quarkus-oidc-token-propagation` and `quarkus-oidc-token-propagation-reactive` extensions to propagate the current `Bearer` or `Authorization Code Flow` access tokens
ja_jp: 現在の `Bearer` または `Authorization Code Flow` アクセストークンを伝搬するための `quarkus-oidc-token-propagation` と `quarkus-oidc-token-propagation-reactive` エクステンション。

source: `quarkus-oidc-token-propagation` extension depends on the `quarkus-oidc` extension and provides JAX-RS `TokenCredentialRequestFilter` which sets the OpenID Connect Bearer or Authorization Code Flow access token as an HTTP `Authorization` header's `Bearer` scheme value. This filter can be registered with MP RestClient implementations injected into the current Quarkus endpoint and the Quarkus endpoint must be protected itself with the Quarkus OpenID Connect adapter. This filter can be used to propagate the access token to the downstream services.
ja_jp: `quarkus-oidc-token-propagation` エクステンションは `quarkus-oidc` エクステンションに依存し、OpenID Connect Bearer または Authorization Code Flow アクセストークンを HTTP `Authorization` ヘッダーの `Bearer` スキーム値として設定する JAX-RS `TokenCredentialRequestFilter` を提供します。このフィルターは、現在の Quarkus エンドポイントに注入された MP RestClient 実装で登録することができ、Quarkus エンドポイント自体は Quarkus OpenID Connect アダプターで保護する必要があります。このフィルターは、アクセストークンをダウンストリームサービスに伝播させるために使用できます。

source: `quarkus-oidc` and `quarkus-smallrye-jwt` can have both JWT and opaque tokens injected into the endpoint code - the injected JWT tokens may offer a richer information about the user. All extensions can have the tokens injected as `Principal`.
ja_jp: `quarkus-oidc` と `quarkus-smallrye-jwt` は、JWT トークンと不透明なトークンの両方をエンドポイントコードに注入することができます。注入された JWT トークンは、ユーザーに関するより豊富な情報を提供することができます。すべてのエクステンションは、 `Principal` として、トークンを注入することができます。
